---
type: InstanceBinding
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# InstanceBinding

`Autodesk.Revit.DB.InstanceBinding` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | InstanceBinding | — | `` |
| Constructor | InstanceBinding | — | `public InstanceBinding ()` |